case2/constant/zoneone/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/zoneone/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          10;
        startFace       1890;
    }
    zoneone_to_zonetwo
    {
        type            mappedPatch;
        inGroups        1(mappedPatch);
        nFaces          10;
        startFace       1900;
        sampleMode      nearestPatchFace;
        sampleRegion    zonetwo;
        samplePatch     zonetwo_to_zoneone;
        sampleDatabase  true;
    }
    upperWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       1910;
    }
    axis
    {
        type            empty;
        inGroups        1(empty);
        nFaces          0;
        startFace       2010;
    }
    front
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          1000;
        startFace       2010;
    }
    back
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          1000;
        startFace       3010;
    }
)

// ************************************************************************* //
